In [4]:
import pandas as pd
import os

In [5]:
c1= ["Srinu","Srinu", "Srilath","Srilath", "Hita","Hita","Arya Vardan" ,"Arya Vardan"]
c2= ["Male", "Male","Female", "Female","Female","Female","Male" ,"Male"]
c3= ["A", "B","A", "B","A","B","A","B"]
c4 =[25000, 45000, 35000, 70000, 50000, 200000, 300000, 500000]


df = pd.DataFrame({"Name": c1, "Gender": c2, "Subject": c3, "Fee": c4})
df

          Name  Gender Subject     Fee
0        Srinu    Male       A   25000
1        Srinu    Male       B   45000
2      Srilath  Female       A   35000
3      Srilath  Female       B   70000
4         Hita  Female       A   50000
5         Hita  Female       B  200000
6  Arya Vardan    Male       A  300000
7  Arya Vardan    Male       B  500000

In [6]:
df.iloc[0, 1:3:]

Gender     Male
Subject       A
Name: 0, dtype: object

In [7]:
#help(df.iloc)

In [9]:
#df.index = ['a', 'b', 'v']
#df

In [10]:
df.iloc[0:2, 0:2]

    Name Gender
0  Srinu   Male
1  Srinu   Male

In [11]:
#os.listdir()

In [12]:
df.groupby("Name").agg("min")

             Gender Subject     Fee
Name
Arya Vardan    Male       A  300000
Hita         Female       A   50000
Srilath      Female       A   35000
Srinu          Male       A   25000

          Name  Gender Subject     Fee
0        Srinu    Male       A   25000
1        Srinu    Male       B   45000
2      Srilath  Female       A   35000
3      Srilath  Female       B   70000
4         Hita  Female       A   50000
5         Hita  Female       B  200000
6  Arya Vardan    Male       A  300000
7  Arya Vardan    Male       B  500000

In [27]:
df.iloc[2][["Name","Fee","Gender"]]

Name      Srilath
Fee         35000
Gender     Female
Name: 2, dtype: object

In [14]:
group1 = df.groupby(["Gender", "Subject"])
group1

In [22]:
for key, item in group1:
    g = group1.get_group(key)
    print(key, "\n")
    print(g, "\n")

('Female', 'A')

      Name  Gender Subject    Fee
2  Srilath  Female       A  35000
4     Hita  Female       A  50000

('Female', 'B')

      Name  Gender Subject     Fee
3  Srilath  Female       B   70000
5     Hita  Female       B  200000

('Male', 'A')

          Name Gender Subject     Fee
0        Srinu   Male       A   25000
6  Arya Vardan   Male       A  300000

('Male', 'B')

          Name Gender Subject     Fee
1        Srinu   Male       B   45000
7  Arya Vardan   Male       B  500000

In [28]:
df

          Name  Gender Subject     Fee
0        Srinu    Male       A   25000
1        Srinu    Male       B   45000
2      Srilath  Female       A   35000
3      Srilath  Female       B   70000
4         Hita  Female       A   50000
5         Hita  Female       B  200000
6  Arya Vardan    Male       A  300000
7  Arya Vardan    Male       B  500000

In [29]:
df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
df

          Name  Gender Subject     Fee
a        Srinu    Male       A   25000
b        Srinu    Male       B   45000
c      Srilath  Female       A   35000
d      Srilath  Female       B   70000
e         Hita  Female       A   50000
f         Hita  Female       B  200000
g  Arya Vardan    Male       A  300000
h  Arya Vardan    Male       B  500000

In [32]:
df.loc['d']

Name       Srilath
Gender      Female
Subject          B
Fee          70000
Name: d, dtype: object

In [33]:
df.loc['d'][["Name", 'Gender']]

Name      Srilath
Gender     Female
Name: d, dtype: object

In [39]:
df.iloc[5]

Name         Hita
Gender     Female
Subject         B
Fee        200000
Name: f, dtype: object

In [40]:
c1 = ['Srinu','Srilath','Hita','Aryavardan']
c2=  ['89', '92', '100', '100']

In [43]:
df1 = pd.DataFrame({'Name': c1})
df1

         Name
0       Srinu
1     Srilath
2        Hita
3  Aryavardan

In [44]:
df2 = pd.DataFrame({'Marks': c2})
df2

  Marks
0    89
1    92
2   100
3   100

In [50]:
df_con = pd.concat([df1, df2], axis=1, names=['A','B'] )
df_con

         Name Marks
0       Srinu    89
1     Srilath    92
2        Hita   100
3  Aryavardan   100

In [52]:
#pd.date_range()

In [53]:
pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')